Revit 2024 API
PointCloudEngineRegistry.GetSupportedEngines Method
 Returns a list of the identifiers supported by point cloud engines registered to Revit.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static IList<string> GetSupportedEngines()
Visual Basic
Public Shared Function GetSupportedEngines As IList(Of String)
Visual C++
public:
static IList<String^>^ GetSupportedEngines()
Return Value
 The list of identifiers.
See Also
PointCloudEngineRegistry Class
Autodesk.Revit.DB.PointClouds Namespace